Rewrite input section
